---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeDefaultBend
source: html/797a5903-fd4d-d7ff-4f0c-7964981a984b.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeDefaultBend

A constraint which can be applied to a RebarShapeSegment, and causes the segment
 to be replaced with a 180-degree arc. The arc's radius is not specified
 by the shape; instead it is a "default bend radius," taken from
 the RebarBarType associated with the Rebar instance.

## Syntax (C#)
```csharp
public class RebarShapeConstraint180DegreeDefaultBend : RebarShapeConstraint
```